//
// Created by forgot on 2019-08-04.
//
/*1048 数字加密 (20 point(s))
*/
/*本题要求实现一种数字加密方法。首先固定一个加密用正整数 A，对任一正整数 B，将其每 1 位数字与 A 的对应位置上的数字进行以下运算：对奇数位，对应位的数字相加后对 13 取余——这里用 J 代表 10、Q 代表 11、K 代表 12；对偶数位，用 B 的数字减去 A 的数字，若结果为负数，则再加 10。这里令个位为第 1 位。

输入格式：
输入在一行中依次给出 A 和 B，均为不超过 100 位的正整数，其间以空格分隔。

输出格式：
在一行中输出加密后的结果。

输入样例：
1234567 368782971
输出样例：
3695Q8118
*/

#include <stdio.h>
#include <string.h>

//与输出有差别
//int main() {
//    char A[101], B[101];
//    scanf("%s", A);
//    scanf("%s", B);
//
//    char ji[14] = {'0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'J', 'Q', 'K'};
//    for (int i = strlen(B) - 1; i >= 0; i--) {
//        if (i % 2 != 0) {
//            int yu = (B[i] + A[i] - '0') % 13;
//            putchar(ji[yu]);
//        } else {
//            int cha = B[i] - A[i];
//            if (cha < 0) {
//                cha = cha + 10;
//            }
//            printf("%d", cha);
//        }
//    }
//
//    return 0;
//}
